src/00_intro/org_test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>org 测试</title>
<!-- 2021-02-21 Sun 07:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="杨 睿" />
</head>
<body>
<div id="content">
<h1 class="title">org 测试</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 标题测试</a></li>
<li><a href="#sec-2">2. 其他测试&#xa0;&#xa0;&#xa0;<span class="tag"><span class="test">test</span></span></a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 标题测试</h2>
<div class="outline-text-2" id="text-1">
<p>
这是一级标题里的内容
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 其他测试&#xa0;&#xa0;&#xa0;<span class="tag"><span class="test">test</span></span></h2>
<div class="outline-text-2" id="text-2">
<p>
balabala
</p>

<ul class="org-ul">
<li><code>[X]</code> Checked.
</li>
<li><code>[-]</code> Half-checked.
</li>
<li><code>[&#xa0;]</code> Not checked.
</li>
<li>Normal list item.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-latex">a = b^2_1
</pre>
</div>

\begin{equation}
x=\sqrt{b}
\end{equation}


<div class="warning">
<p>
Be careful!  Check that you have&#x2026;
</p>

</div>


<div class="note">
<p>
This is a useful note.
</p>

</div>

<div class="tip">
<p>
Try doing it this way&#x2026;
</p>

</div>

<dl class="org-dl">
<dt> testdasdad </dt><dd>dadadasd
</dd>
</dl>

<div class="seealso">
<dl class="org-dl">
<dt> <a href="http://en.wikipedia.org/wiki/Apple">Apples</a> </dt><dd>     A kind of <a href="http://en.wikipedia.org/wiki/Fruit">fruit</a>.
</dd>
</dl>

</div>


<pre class="example">
10/17/97   9:04         &lt;DIR&gt;    bin
10/16/97  14:11         &lt;DIR&gt;    DOS
10/16/97  14:46         &lt;DIR&gt;    TEMP
10/16/97  14:37         &lt;DIR&gt;    WINNT
10/16/97  14:25             119  AUTOEXEC.BAT
 2/13/94   6:21          54,619  COMMAND.COM
</pre>


<p>
The formula \(a^2 + b^2 = c^2\) has been discovered by Pythagoras.
</p>

<p>
Let \(a=\sin(x) + \cos(x)\). Then \(a^2 = 2\sin(x)\cos(x)\) because \(\sin^2x +
\cos^2x = 1\).
</p>

<p>
It is possible to define named footnotes<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>, or ones with automatic
anchors<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>



<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">a</span> = 1
<span class="org-variable-name">b</span> = 2
<span class="org-keyword">print</span>(a+b)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-go">var (
  AIOInstStatusUnknown uint32 = 0
  AIOInstStatusRunning uint32 = 1
  AIOInstStatusStopped uint32 = 2
  AIOInstStatusFailed uint32 = 3

  AIOInstStatusInitializing     uint32 = 11
  AIOInstStatusInitializeFailed uint32 = 12
  AIOInstStatusQueueing         uint32 = 13

  AIOInstStatusStopping   uint32 = 21
  AIOInstStatusStopFailed uint32 = 22

  AIOExportRunning uint32 = 31
  AIOExportSuccess uint32 = 32
  AIOExportFailed uint32 = 33
)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">-*- coding: utf-8 -*-</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@File : gen_index.py</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@Author : r.yang</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@Date : Fri Feb 19 18:11:08 2021</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">@Description : format string</span>

<span class="org-keyword">import</span> os
<span class="org-keyword">import</span> sys
<span class="org-keyword">from</span> collections <span class="org-keyword">import</span> defaultdict
<span class="org-keyword">import</span> datetime

<span class="org-variable-name">CURRENT_DIR</span> = os.path.dirname(os.path.abspath(__file__))
<span class="org-variable-name">HEADER</span> = <span class="org-string">"""</span>
<span class="org-string">#+OPTIONS: ^:nil</span>
<span class="org-string">#+ATTR_LATEX: :width 5cm :options angle=90</span>
<span class="org-string">#+TITLE: &#32034;&#24341;</span>
<span class="org-string">#+AUTHOR: &#26472; &#30591;</span>
<span class="org-string">#+EMAIL: yangruipis@163.com</span>
<span class="org-string">#+KEYWORDS: index</span>
<span class="org-string">#+OPTIONS: H:4 toc:t</span>
<span class="org-string">#+SETUPFILE: https://gitee.com/yangruigit/my_blogs/raw/master/lib/theme-readtheorg.setup</span>
<span class="org-string">"""</span>


<span class="org-keyword">def</span> <span class="org-function-name">extract_abs</span>(path):
    <span class="org-variable-name">lines</span> = <span class="org-builtin">open</span>(path).read().splitlines()
    <span class="org-variable-name">newlines</span> = []
    <span class="org-keyword">for</span> line <span class="org-keyword">in</span> lines:
        <span class="org-keyword">if</span> line.startswith(<span class="org-string">"*"</span>) <span class="org-keyword">or</span> line.startswith(<span class="org-string">"#"</span>) <span class="org-keyword">or</span> line.strip() == <span class="org-string">""</span>:
            <span class="org-keyword">continue</span>
        <span class="org-keyword">else</span>:
            newlines.append(line)
    <span class="org-variable-name">newlines</span> = newlines[:3]
    <span class="org-keyword">if</span> newlines:
        <span class="org-keyword">return</span> <span class="org-string">"\n"</span>.join(newlines)[:200]
    <span class="org-keyword">return</span> <span class="org-string">""</span>


<span class="org-keyword">def</span> <span class="org-function-name">main</span>():
    <span class="org-variable-name">index_txt</span> = HEADER
    <span class="org-variable-name">src_dir</span> = os.path.join(CURRENT_DIR, <span class="org-string">'../src'</span>)

    <span class="org-keyword">for</span> root, dirs, files <span class="org-keyword">in</span> os.walk(src_dir):
        <span class="org-variable-name">eles</span> = root.split(<span class="org-string">"src"</span>)[-1].split(<span class="org-string">"/"</span>)
        <span class="org-variable-name">eles</span> = [i <span class="org-keyword">for</span> i <span class="org-keyword">in</span> eles <span class="org-keyword">if</span> i.strip()]
        <span class="org-keyword">if</span> eles:
            <span class="org-variable-name">index_txt</span> += (<span class="org-string">"*"</span> * (<span class="org-builtin">len</span>(eles)) + <span class="org-string">" {}"</span>.<span class="org-builtin">format</span>(eles[-1]) + <span class="org-string">"\n"</span>)

        <span class="org-variable-name">star_len</span> = <span class="org-builtin">len</span>(eles) + 1
        <span class="org-keyword">for</span> file_ <span class="org-keyword">in</span> files:
            <span class="org-keyword">if</span> file_.endswith(<span class="org-string">".org"</span>):
                <span class="org-variable-name">path</span> = os.path.join(root, file_)
                <span class="org-variable-name">ts</span> = os.stat(path).st_mtime
                <span class="org-variable-name">date</span> = datetime.datetime.fromtimestamp(ts)

                <span class="org-variable-name">title</span> = <span class="org-string">" [{}] {}"</span>.<span class="org-builtin">format</span>(date.strftime(<span class="org-string">"%Y-%m-%d"</span>),
                                          file_.replace(<span class="org-string">".org"</span>, <span class="org-string">""</span>))

                <span class="org-variable-name">index_txt</span> += <span class="org-string">"*"</span> * star_len + <span class="org-string">" [[file:{}][{}]]"</span>.<span class="org-builtin">format</span>(
                    <span class="org-string">"/"</span>.join([<span class="org-string">"./src"</span>] + eles + [file_]), title)
                <span class="org-variable-name">index_txt</span> += <span class="org-string">"\n"</span>
                <span class="org-variable-name">index_txt</span> += extract_abs(os.path.join(root, file_))
                <span class="org-variable-name">index_txt</span> += <span class="org-string">"\n"</span>
    <span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">"./index.org"</span>, <span class="org-string">"w"</span>) <span class="org-keyword">as</span> f:
        f.write(index_txt)


<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> == <span class="org-string">"__main__"</span>:
    main()
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Extensively used in large documents.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: 杨 睿</p>
<p class="date">Created: 2021-02-21 Sun 07:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
